a = (input())
b = (input())
if a == "красный" and b == "красный":
    print("красный")
elif a == "красный" and b == "синий":
    print("фиолетовый")
elif a == "красный" and b == "желтый":
    print("оранжевый")
elif b == "красный" and a == "синий":
    print("фиолетовый")
elif b == "красный" and a == "желтый": #Красный
    print("оранжевый")
elif a == "желтый" and b == "красный":
    print("оранжевый")
elif a == "желтый" and b == "синий":
    print("зеленый")
elif b == "желтый" and a == "красный":
    print("оранжевый")
elif b == "желтый" and a == "синий":
    print("зеленый")
elif b == "желтый" and a == "желтый": #Желтый
    print("желтый")
elif a == "синий" and b == "синий":
    print("синий")
elif a == "синий" and b == "желтый":
    print("зеленый")
elif b == "синий" and a == "красный":
    print("фиолетовый")
elif b == "синий" and a == "желтый":
    print("зеленый")
elif b == "синий" and a == "красный": #Желтый
    print("фиолетовый")
else:
    print("ошибка цвета")